; domain
(define (domain baseline_domain)


    (:predicates
    
        (at ?o ?p)
        (on ?m ?b)
        (over ?b ?m)
        
        (is_monkey ?m)
        (is_place ?p)
        (is_banana ?b)
        (is_box ?b)
        
        (has ?m ?o)
        
    )


    (:action go
        :parameters (?monkey ?start ?end)
        :precondition (and (is_monkey ?monkey) (is_place ?start) (is_place ?end) (at ?monkey ?start))
        :effect (and (at ?monkey ?end) (not(at ?monkey ?start)))
    )
    
    (:action push
        :parameters (?monkey ?box ?start ?end)
        :precondition (and (is_monkey ?monkey) (is_box ?box) (is_place ?start) (is_place ?end)
        (at ?monkey ?start) (at ?box ?start) (not(on ?monkey ?box)))
        :effect (and  (not(at ?monkey ?start)) (not(at ?box ?start))  (at ?monkey ?end) (at ?box ?end))
    )
    
    (:action climb_up
        :parameters (?monkey ?box ?place)
        :precondition (and (is_monkey ?monkey) (is_box ?box) (is_place ?place) (not(on ?monkey ?box)) (at ?monkey ?place) (at ?box ?place))
        :effect (and (on ?monkey ?box))
    )
    
    (:action climb_down
        :parameters (?monkey ?box ?place)
        :precondition (and (is_monkey ?monkey) (is_box ?box) (is_place ?place) (on ?monkey ?box) (at ?monkey ?place) (at ?box ?place))
        :effect (and (not(on ?monkey ?box)))
    )
    
    (:action grasp
        :parameters (?monkey ?place ?banana ?box)
        :precondition (and (is_monkey ?monkey) (is_banana ?banana) (is_place ?place) (is_box ?box) 
        (on ?monkey ?box) (over ?banana ?monkey) (at ?monkey ?place) (at ?banana ?place) (at ?box ?place) (not(has ?monkey ?banana)))
        :effect (and (has ?monkey ?banana) (not(over ?banana ?monkey)))
    )
    
    (:action ungrasp
        :parameters (?monkey ?place ?banana ?box)
        :precondition (and (is_monkey ?monkey) (is_banana ?banana) (is_place ?place) (is_box ?box) 
        (on ?monkey ?box) (at ?monkey ?place) (at ?banana ?place) (has ?monkey ?banana))
        :effect (and (not(has ?monkey ?banana)) (over ?banana ?monkey))
    )
)

; problem
(define (problem baseline_problem)
    (:domain baseline_domain)

    (:objects monkey banana box place_a place_b place_c)
    
    (:init (is_monkey monkey)
           (is_banana banana)
           (is_box box)
    
           (is_place place_a)
           (is_place place_b)
           (is_place place_c)          
            
           (at box place_a)  
           (at banana place_b)
           (at monkey place_c)
           
           (over banana monkey)
           )
    (:goal (has monkey banana)))

; plan
1. (go monkey place_c place_a)
   deleted: (at monkey place_c)
   added: (at monkey place_a)
   goals met: 0 of 1
2. (push monkey box place_a place_b)
   deleted: (at monkey place_a) (at box place_a)
   added: (at monkey place_b) (at box place_b)
   goals met: 0 of 1
3. (climb_up monkey box place_b)
   added: (on monkey box)
   goals met: 0 of 1
4. (grasp monkey place_b banana box)
   deleted: (over banana monkey)
   added: (has monkey banana)
   goals met: 1 of 1
